BIG-02.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session Lec-2 Data Processing with higher-order methods
#+PROPERTY: header-args:ipython :session Lec-2 Data Processing with higher-order methods
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme.css" >
# #+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
# #+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
# #+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:nil ^:nil _:nil tags:not-in-toc
#+TITLE: Lec-2 Data Processing with higher-order methods
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


* API of Souce, Iterator
  1. build a *case class* for the columns of data source file you concern
     1) each *line* will be represented as an *case object*
     2) why case class, maybe use it as a *pattern* later.
  2. do some *filtering* to read-in data
     1) read in and handle it
        - make non-present value ~Option~ *OR*
        - give default value to related case class Ctor parameter
          + in case class definition *OR*
          + in process of *line to case object*
     2) throw out everything of line that have a dot
        throw out means ~Ignore~ using ~flatMap~ and ~for~
  3. do *transformation* from line to case object
** TODO : how to read txt from file
#+BEGIN_SRC scala
val source = scala.io.Source.fromFile(<filePath>)
#+END_SRC

** TODO : how to get whole text's Iterator by unit of line
#+BEGIN_SRC scala
val linIter = source.getLines
#+END_SRC

** TODO : how to get 30 lines from front of the whole text's Iteratror
Note that , ~Iterator~ is a special kind of ~collection~, which can be ONLY traverse
ONCE( extends from TraversableOnce[T]). It has most API methods of ~collection~:
- take
- drop
- map
- flatMap
- etc
#+BEGIN_SRC scala
val seq = linIter.take(30).toSeq
#+END_SRC

** TODO : not get ~length~ of a iterator

    ~iterator.length~ will consume the ~next~.

#+BEGIN_SRC scala
  val arr = Array.fill(30)(2)
  val lines = arr.iterator
  lines.hasNext // true
  lines.length  // 30
  lines.hasNext // false
#+END_SRC

