BIG-02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-08 三 23:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lec-2 Data Processing with higher-order methods</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme.css" >
</head>
<body>
<div id="content">
<h1 class="title">Lec-2 Data Processing with higher-order methods</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8225754">API of Souce, Iterator</a>
<ul>
<li><a href="#orga60d9c6"><span class="todo TODO">TODO</span> : how to read txt from file</a></li>
<li><a href="#org3f28ecc"><span class="todo TODO">TODO</span> : how to get whole text's Iterator by unit of line</a></li>
<li><a href="#org182b671"><span class="todo TODO">TODO</span> : how to get 30 lines from front of the whole text's Iteratror</a></li>
<li><a href="#org704f6dd"><span class="todo TODO">TODO</span> : not get <code>length</code> of a iterator</a></li>
</ul>
</li>
<li><a href="#org0cfd5ed">how to deal with value non-present in data source file</a></li>
<li><a href="#org5b67db8">Do Sorting</a></li>
<li><a href="#org3a0062f">Do Counting</a></li>
<li><a href="#org1af169f">Do something respectively on group</a></li>
<li><a href="#orgd377ad0">summarization</a>
<ul>
<li><a href="#org36ab8df">1. pre-process</a></li>
<li><a href="#orgc3794c3">2. computation</a>
<ul>
<li><a href="#org9dd4630">max:</a></li>
<li><a href="#org8a4662b">count:</a></li>
<li><a href="#org90707ea">none-independent variable:</a></li>
<li><a href="#org3351f48">group related variable</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="org8225754" class="outline-2">
<h2 id="org8225754">API of Souce, Iterator</h2>
<div class="outline-text-2" id="text-org8225754">
<ol class="org-ol">
<li>build a <b>case class</b> for the columns of data source file you concern
<ol class="org-ol">
<li>each <b>line</b> will be represented as an <b>case object</b></li>
<li>why case class, maybe use it as a <b>pattern</b> later.</li>
</ol></li>
<li>do some <b>filtering</b> to read-in data
<ol class="org-ol">
<li>read in and handle it
<ul class="org-ul">
<li>make non-present value <code>Option</code> <b>OR</b></li>
<li>give default value to related case class Ctor parameter
<ul class="org-ul">
<li>in case class definition <b>OR</b></li>
<li>in process of <b>line to case object</b></li>
</ul></li>
</ul></li>
<li>throw out everything of line that have a dot
throw out means <code>Ignore</code> using <code>flatMap</code> and <code>for</code></li>
</ol></li>
<li>do <b>transformation</b> from line to case object</li>
</ol>
</div>
<div id="orga60d9c6" class="outline-3">
<h3 id="orga60d9c6"><span class="todo TODO">TODO</span> : how to read txt from file</h3>
<div class="outline-text-3" id="text-orga60d9c6">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">source</span> <span style="color: #4f97d7; font-weight: bold;">=</span> scala.io.<span style="color: #a45bad;">Source</span>.fromFile(&lt;filePath&gt;)
</pre>
</div>
</div>
</div>

<div id="org3f28ecc" class="outline-3">
<h3 id="org3f28ecc"><span class="todo TODO">TODO</span> : how to get whole text's Iterator by unit of line</h3>
<div class="outline-text-3" id="text-org3f28ecc">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">linIter</span> <span style="color: #4f97d7; font-weight: bold;">=</span> source.getLines
</pre>
</div>
</div>
</div>

<div id="org182b671" class="outline-3">
<h3 id="org182b671"><span class="todo TODO">TODO</span> : how to get 30 lines from front of the whole text's Iteratror</h3>
<div class="outline-text-3" id="text-org182b671">
<p>
Note that , <code>Iterator</code> is a special kind of <code>collection</code>, which can be ONLY traverse
ONCE( extends from TraversableOnce[T]). It has most API methods of <code>collection</code>:
</p>
<ul class="org-ul">
<li>take</li>
<li>drop</li>
<li>map</li>
<li>flatMap</li>
<li>etc</li>
</ul>
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">seq</span> <span style="color: #4f97d7; font-weight: bold;">=</span> linIter.take(<span style="color: #a45bad;">30</span>).toSeq
</pre>
</div>
</div>
</div>

<div id="org704f6dd" class="outline-3">
<h3 id="org704f6dd"><span class="todo TODO">TODO</span> : not get <code>length</code> of a iterator</h3>
<div class="outline-text-3" id="text-org704f6dd">
<p>
<code>iterator.length</code> will consume the <code>next</code>.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">arr</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Array</span>.fill(<span style="color: #a45bad;">30</span>)(<span style="color: #a45bad;">2</span>)
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">lines</span> <span style="color: #4f97d7; font-weight: bold;">=</span> arr.iterator
lines.hasNext <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
lines.length  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">30</span>
lines.hasNext <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">false</span>
</pre>
</div>
</div>
</div>
</div>
