BIG-02.org
* how to deal with value non-present in data source file
  #+BEGIN_SRC scala
    package standardscala

    /*
     TODO
     0. read in dataset, build case class, build your object line by line
     1. handle the non-present data --- read-in and handle for precip and snow
     2. handle the non-present data --- ignore the whole line if exist in tave,tmax,tmin
     3. compute the highest temperature(2good,1bad)
     4. get number of rainy day and rainy probability(1 methods)
     5. for all rainy days, get the average high temperature(1good,1better)
     6. get the average temperature by month
     ,*/

    case class TempInfo(day:Int,
                        doy:Int,
                        month:Int,
                        year:Int,
                        prcp:Double,
                        snow:Double,
                        tave:Double,
                        tmax:Double,
                        tmin:Double)

    object TempInfo extends App{
      // read in dataset

      // deal with non-present value
      def toDoubleOrNeg(str:String): Double = {
        try {
          str.toDouble
        } catch {
          case _:NumberFormatException => -1
        }
      }

      // get source from file
      val src = scala.io.Source.fromFile("/Users/yiddishkop/Worklap/StudyBDAS/MN212142_9392.csv")
      // get line iterator from source
      val lines = src.getLines.drop(1)

      // lines is an iterator[String] so data is an iterator[TempInfo]
      // flatmap maybe the best method to ignore some items of collection who call it.
      val data = lines.flatMap {
        line => {
          val arr = line.split(",'|',|,")
          if (arr(7) == "." || arr(8) == "." ||arr(9) == ".") Seq.empty
          else Seq(TempInfo(arr(0).toInt,
                            arr(1).toInt,
                            arr(2).toInt,
                            arr(4).toInt,
                            toDoubleOrNeg(arr(5)),
                            toDoubleOrNeg(arr(6)),
                            arr(7).toDouble,
                            arr(8).toDouble,
                            arr(9).toDouble))
        }
      }.toArray

      src.close

      data.take(5).foreach(println)

      // compute the highest temperature(2good,1bad)

      // bad 1, traverse 3 time, and build 2 same-size cache data by filter,map.
      val maxTmax = data.filter(_!= null).map(_.tmax).max
      println(maxTmax)

      // better 1 : reduceLeft
      val maxTempInfo = data.reduceLeft((a,b) => if (a.tmax > b.tmax) a else b)
      println(maxTempInfo)

      // better 2 : sortWith
      // use Ordering, where must exist implicit conversion from a.tmax.type to Ordering[a.tmax.type]
      // which pre-defined in Ordering[T]
      val maxTempInfo2 = data.maxBy { a => a.tmax }
      println(maxTempInfo2)

      // get number of rainy day and rainy probability
      val rainyDays = data.count(_.prcp>=1.0)
      println(s"rainy days: $rainyDays, and rainy probability: ${rainyDays * 100.0/data.length}")

      // for all rainy days, get the average high temperature

      // This is why foldLeft is bettern than reduceLeft, who require the same return type with element itself
      // reduceLeft: (A,A)=>A composeNext A
      // foldLeft: (B,A)=>B composeNext A
      val (rainyTmp, rainyDays2) = data.foldLeft(0.0 -> 0) {
        case ((a, b), tempInfo) if tempInfo.prcp >= 1.0 => (a+tempInfo.tmax, b+1)
        case ((a, b), _)                                => (a,b)
      }

      println(s"There are rainyDays: $rainyDays2, sum together: $rainyTmp, avg tmp:${rainyTmp/rainyDays2}")

      // a worse method: flatMap
      // use flatMap to ignore the non-rainy days, to get a subset to hold all desire elements
      val rainyData = data.flatMap {
        case a if a.prcp >= 1.0 => Seq(a.tmax)
        case _ => Seq.empty
      }
      println(s"The avg tmp:${rainyData.sum/rainyData.length}")

      // get the average temperature by month
      // get a Map[Int,List[TempInfo]] like(1 -> (tempinfo1, tempinfo2, tempinfo23), 2-> (tempinfo4, tempinfor56))
      val monthTemp = data.groupBy(_.month)
      // get Map(month, avgTmax)
      val monthSeq = monthTemp.map{
        case (m, l) => m -> {
          l.foldLeft(0.0) { (a, tmp) => (a + tmp.tmax) } / l.length
        }
      }
      monthSeq.toSeq.sortBy(_._1).foreach(println)
    }

  #+END_SRC
  1. read in and handle it
     1. make non-present value ~Option~ *OR*
     2. give default value to related case class Ctor parameter
        1. in case class definition *OR*
        2. in process of *line to case object*
  2. throw out the line
     throw out means ~Ignore~ like codes below

  #+BEGIN_QUOTE
     Ignoring the elements not fit requirement, 2 methods:
     1. flatMap(using the hidden mixing operation)
     2. for(using the hidden pattern match operation)
  #+END_QUOTE

  #+BEGIN_SRC scala
    val arr = Array.fill(30)(scala.util.Random.nextInt(100))

    /*
     Ignoring the elements not fit requirement, 2 methods:
     1. flatMap(using the hidden mixing operation)
     2. for(using the hidden pattern match operation)
     */

    // method 1
    arr.flatMap{
      case i if i > 30 => Seq.empty
      case i           => Seq(i)
    }

    // method 2
    for (i <- arr
         if i < 30) yield i
  #+END_SRC

