BIG-02.html

<div id="org0cfd5ed" class="outline-2">
<h2 id="org0cfd5ed">how to deal with value non-present in data source file</h2>
<div class="outline-text-2" id="text-org0cfd5ed">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">package</span> <span style="color: #2d9574;">standardscala</span>

<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> </span><span style="color: #cc9393;">TODO</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 0. read in dataset, build case class, build your object line by line</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 1. handle the non-present data --- read-in and handle for precip and snow</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 2. handle the non-present data --- ignore the whole line if exist in tave,tmax,tmin</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 3. compute the highest temperature(2good,1bad)</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 4. get number of rainy day and rainy probability(1 methods)</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 5. for all rainy days, get the average high temperature(1good,1better)</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 6. get the average temperature by month</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>

<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">TempInfo</span>(day<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Int</span>,
                    doy<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Int</span>,
                    month<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Int</span>,
                    year<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Int</span>,
                    prcp<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Double</span>,
                    snow<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Double</span>,
                    tave<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Double</span>,
                    tmax<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Double</span>,
                    tmin<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">Double</span>)

<span style="color: #4f97d7; font-weight: bold;">object</span> <span style="color: #a45bad;">TempInfo</span> <span style="color: #4f97d7; font-weight: bold;">extends</span> <span style="color: #ce537a; font-weight: bold;">App</span>{
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">read in dataset</span>

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">deal with non-present value</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">toDoubleOrNeg</span>(str<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">String</span>)<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #4f97d7; font-weight: bold;">=</span> {
    <span style="color: #4f97d7; font-weight: bold;">try</span> {
      str.toDouble
    } <span style="color: #4f97d7; font-weight: bold;">catch</span> {
      <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #4f97d7; font-weight: bold;">_:</span><span style="color: #ce537a; font-weight: bold;">NumberFormatException</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> -<span style="color: #a45bad;">1</span>
    }
  }

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">get source from file</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">src</span> <span style="color: #4f97d7; font-weight: bold;">=</span> scala.io.<span style="color: #a45bad;">Source</span>.fromFile(<span style="color: #2d9574;">"/Users/yiddishkop/Worklap/StudyBDAS/MN212142_9392.csv"</span>)
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">get line iterator from source</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">lines</span> <span style="color: #4f97d7; font-weight: bold;">=</span> src.getLines.drop(<span style="color: #a45bad;">1</span>)

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">lines is an iterator[String] so data is an iterator[TempInfo]</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">flatmap maybe the best method to ignore some items of collection who call it.</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">data</span> <span style="color: #4f97d7; font-weight: bold;">=</span> lines.flatMap {
    line <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> {
      <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">arr</span> <span style="color: #4f97d7; font-weight: bold;">=</span> line.split(<span style="color: #2d9574;">",'|',|,"</span>)
      <span style="color: #4f97d7; font-weight: bold;">if</span> (arr(<span style="color: #a45bad;">7</span>) == <span style="color: #2d9574;">"."</span> || arr(<span style="color: #a45bad;">8</span>) == <span style="color: #2d9574;">"."</span> ||arr(<span style="color: #a45bad;">9</span>) == <span style="color: #2d9574;">"."</span>) <span style="color: #a45bad;">Seq</span>.empty
      <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #a45bad;">Seq</span>(<span style="color: #a45bad;">TempInfo</span>(arr(<span style="color: #a45bad;">0</span>).toInt,
                        arr(<span style="color: #a45bad;">1</span>).toInt,
                        arr(<span style="color: #a45bad;">2</span>).toInt,
                        arr(<span style="color: #a45bad;">4</span>).toInt,
                        toDoubleOrNeg(arr(<span style="color: #a45bad;">5</span>)),
                        toDoubleOrNeg(arr(<span style="color: #a45bad;">6</span>)),
                        arr(<span style="color: #a45bad;">7</span>).toDouble,
                        arr(<span style="color: #a45bad;">8</span>).toDouble,
                        arr(<span style="color: #a45bad;">9</span>).toDouble))
    }
  }.toArray

  src.close

  data.take(<span style="color: #a45bad;">5</span>).foreach(println)

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">compute the highest temperature(2good,1bad)</span>

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">bad 1, traverse 3 time, and build 2 same-size cache data by filter,map.</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">maxTmax</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.filter(<span style="color: #4f97d7; font-weight: bold;">_</span>!= <span style="color: #a45bad;">null</span>).map(<span style="color: #4f97d7; font-weight: bold;">_</span>.tmax).max
  println(maxTmax)

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">better 1 : reduceLeft</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">maxTempInfo</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.reduceLeft((a,b) <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">if</span> (a.tmax &gt; b.tmax) a <span style="color: #4f97d7; font-weight: bold;">else</span> b)
  println(maxTempInfo)

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">better 2 : sortWith</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">use Ordering, where must exist implicit conversion from a.tmax.type to Ordering[a.tmax.type]</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">which pre-defined in Ordering[T]</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">maxTempInfo2</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.maxBy { a <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> a.tmax }
  println(maxTempInfo2)

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">get number of rainy day and rainy probability</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">rainyDays</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.count(<span style="color: #4f97d7; font-weight: bold;">_</span>.prcp&gt;=<span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span>)
  println(s<span style="color: #2d9574;">"rainy days: </span><span style="color: #7590db;">$rainyDays</span><span style="color: #2d9574;">, and rainy probability: </span><span style="color: #7590db;">${rainyDays * 100.0/data.length}</span><span style="color: #2d9574;">"</span>)

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">for all rainy days, get the average high temperature</span>

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">This is why foldLeft is bettern than reduceLeft, who require the same return type with element itself</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">reduceLeft: (A,A)=&gt;A composeNext A</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">foldLeft: (B,A)=&gt;B composeNext A</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> (<span style="color: #7590db;">rainyTmp</span>, <span style="color: #7590db;">rainyDays2</span>) <span style="color: #4f97d7; font-weight: bold;">=</span> data.foldLeft(<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span> -&gt; <span style="color: #a45bad;">0</span>) {
    <span style="color: #4f97d7; font-weight: bold;">case</span> ((<span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>), <span style="color: #7590db;">tempInfo</span>) <span style="color: #4f97d7; font-weight: bold;">if</span> tempInfo.prcp &gt;= <span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> (a+tempInfo.tmax, b+<span style="color: #a45bad;">1</span>)
    <span style="color: #4f97d7; font-weight: bold;">case</span> ((<span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>), <span style="color: #4f97d7; font-weight: bold;">_</span>)                                <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> (a,b)
  }

  println(s<span style="color: #2d9574;">"There are rainyDays: </span><span style="color: #7590db;">$rainyDays2</span><span style="color: #2d9574;">, sum together: </span><span style="color: #7590db;">$rainyTmp</span><span style="color: #2d9574;">, avg tmp:</span><span style="color: #7590db;">${rainyTmp/rainyDays2}</span><span style="color: #2d9574;">"</span>)

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">a worse method: flatMap</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">use flatMap to ignore the non-rainy days, to get a subset to hold all desire elements</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">rainyData</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.flatMap {
    <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #7590db;">a</span> <span style="color: #4f97d7; font-weight: bold;">if</span> a.prcp &gt;= <span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #a45bad;">Seq</span>(a.tmax)
    <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #a45bad;">Seq</span>.empty
  }
  println(s<span style="color: #2d9574;">"The avg tmp:</span><span style="color: #7590db;">${rainyData.sum/rainyData.length}</span><span style="color: #2d9574;">"</span>)

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">get the average temperature by month</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">get a Map[Int,List[TempInfo]] like(1 -&gt; (tempinfo1, tempinfo2, tempinfo23), 2-&gt; (tempinfo4, tempinfor56))</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">monthTemp</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.groupBy(<span style="color: #4f97d7; font-weight: bold;">_</span>.month)
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">get Map(month, avgTmax)</span>
  <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">monthSeq</span> <span style="color: #4f97d7; font-weight: bold;">=</span> monthTemp.map{
    <span style="color: #4f97d7; font-weight: bold;">case</span> (<span style="color: #7590db;">m</span>, <span style="color: #7590db;">l</span>) <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> m -&gt; {
      l.foldLeft(<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span>) { (a, tmp) <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> (a + tmp.tmax) } / l.length
    }
  }
  monthSeq.toSeq.sortBy(<span style="color: #4f97d7; font-weight: bold;">_</span>._1).foreach(println)
}

</pre>
</div>
<ol class="org-ol">
<li>read in and handle it
<ol class="org-ol">
<li>make non-present value <code>Option</code> <b>OR</b></li>
<li>give default value to related case class Ctor parameter
<ol class="org-ol">
<li>in case class definition <b>OR</b></li>
<li>in process of <b>line to case object</b></li>
</ol></li>
</ol></li>
<li>throw out the line
throw out means <code>Ignore</code> like codes below</li>
</ol>

<blockquote>
<p>
Ignoring the elements not fit requirement, 2 methods:
</p>
<ol class="org-ol">
<li>flatMap(using the hidden mixing operation)</li>
<li>for(using the hidden pattern match operation)</li>
</ol>
</blockquote>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">arr</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Array</span>.fill(<span style="color: #a45bad;">30</span>)(scala.util.<span style="color: #a45bad;">Random</span>.nextInt(<span style="color: #a45bad;">100</span>))

<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Ignoring the elements not fit requirement, 2 methods:</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 1. flatMap(using the hidden mixing operation)</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 2. for(using the hidden pattern match operation)</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">method 1</span>
arr.flatMap{
  <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #7590db;">i</span> <span style="color: #4f97d7; font-weight: bold;">if</span> i &gt; <span style="color: #a45bad;">30</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #a45bad;">Seq</span>.empty
  <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #7590db;">i</span>           <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #a45bad;">Seq</span>(i)
}

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">method 2</span>
<span style="color: #4f97d7; font-weight: bold;">for</span> (i <span style="color: #4f97d7; font-weight: bold;">&lt;-</span> arr
     <span style="color: #4f97d7; font-weight: bold;">if</span> i &lt; <span style="color: #a45bad;">30</span>) <span style="color: #4f97d7; font-weight: bold;">yield</span> i
</pre>
</div>
</div>
</div>
