BIG-02.org
* Do Sorting

  #+BEGIN_QUOTE
  you should always try your best to get the result you want ,by *ONLY ONE TRAVERSE*.
  #+END_QUOTE

  when refer to Ordering or Sorting or compute Max, one key thing should be kept in mind that, you are dealing with BIG DATA, try your best to traverse as least times as you can.

  there are 3 useful methods for compute or ordering:
  1. map & filter (*VERY BAD*, consume too mem and time)
  2. reduceLeft or foldLeft
  3. maxBy, maxWith, sortBy, sortWith
   
  #+BEGIN_SRC scala
    // Then you get the data ,and may ask some question, like:
    // what is highest temperature

    // BAD method
    val maxTemp = data.map(_.tmax).max
    val hotDays = data.filter(_.tmax == maxTemp)
    println(s"Hot days are ${hotDays.mkString(", ")}")

    /* why bad?
     BUUUT, drawbacks of code above is that, you do TRAVERSE directly
     on WHOLE dataset THREE times, and create WHOLE NEW dataset TWO time:
     Traverse: data.map, data.map.max, data.filter. ===> time consumer
     New: data.map, data.filter                     ===> memo consumer
     If size of dataset is very large, this will get down the speed
     and even lead to "Stack Over Flow"
    ,*/

    // GOOD method
    val hotDay = data.maxBy(_.tmax)
    println(s"Hot day is $hotDay")

    // another GOOD
    val hotDay2 = data.reduceLeft((d1,d2) => if ( d1.tmax >= d2.tmax ) d1 else d2 )
    println(s"Hot day is $hotDay2")
  #+END_SRC

* Do Counting
  [Q]why using ~x -> y~ instead of ~(x,y)~
  [A]you see that two ~()~ there :) , some time forgetting will lead a big error.

  #+BEGIN_QUOTE
  you should always try your best to get the result you want ,by *ONLY ONE TRAVERSE*.
  #+END_QUOTE

  So, ~map~ and ~filter~ is BAD, forget about them unless you have no choice.

  ~count~ can hold, if do counting without other computation, else ~foldLeft~ and ~flatMap~ are two powerful tool to handle this

  1. count
  2. foldLeft
  3. flatMap

* Do something respectively on group

  1. groupBy => map
  2. grouped => Iterator

  #+BEGIN_SRC scala
    val arr = Array((1,2,3), (4,2,4), (22,2,2342),(121,1,234),(11,1,111))
    arr.groupBy(_._2)
    /*
     scala.collection.immutable.Map[Int,Array[(Int, Int, Int)]] =
     Map(2 -> Array((1,2,3), (4,2,4), (22,2,2342)),
     1 -> Array((121,1,234), (11,1,111)))
     ,*/

    arr.grouped(2).toArray
    /*
     Array[Array[(Int, Int, Int)]] =
     Array(Array((1,2,3), (4,2,4)),
           Array((22,2,2342), (121,1,234)),
           Array((11,1,111)))
    ,*/
  #+END_SRC

  groupBy give us back a collection that makes it much easier to work on groupings of values which is often used very significant in the big data framework, eg. Hadoop was completely set up to work with key-value pairs, this key-value pair type of approach to things winds up being significant for a lot of our data analysis in SPARK

* summarization
  #+BEGIN_EXAMPLE
  |-------------+-----------------------------+-------------------------------------|
  | program     | process                     | key-tech                            |
  |-------------+-----------------------------+-------------------------------------|
  | pre-process | define case class           |                                     |
  |             | .csv -> source              | scala.io.Source.fromFile            |
  |             | source -> iterator          | getLines                            |
  |             | iterator -> Array[caseObje] | flatMap to filter out unrequirement |
  |-------------+-----------------------------+-------------------------------------|
  | computation | max                         | maxBy, reduceLeft                   |
  |             | count                       | count                               |
  |             | non-independent variable    | foldLeft, flatMap                   |
  |             | group related variable      | groupBy -> map((a,b)=>a->{fnOnB}    |
  |             |                             | -> toSeq.sortBy                     |
  |-------------+-----------------------------+-------------------------------------|
  #+END_EXAMPLE

** 1. pre-process
   - define case class
   - .csv => scala.io.Source.fromFile => source
   - source => getLines => line iterator[String]
   - iterator => flatMap to ignore garbage data => array[caseObj]
** 2. computation
*** max:
    - ~array.reduceLeft~
    - ~array.maxBy~
*** count:
    ~array.count~
*** none-independent variable:
    get embedded variable all at once by
    - ~array.foldLeft~, BAB
    - ~array.flatMap~, get a subset of requirement elements, get rid of others by its implicit fitering
*** group related variable
    1. ~array.groupBy~ , to get a map(group, *listOfCaseObject*)
    2. ~Map.map{(a,b) => a -> {fn on b}}~, to extract information you want and get another ~Map~
    3. ~Map.toSeq.sortBy~, the thing sortBy must have some implicit coversion to Ordering[T]
