BIG-02.html

<div id="org5b67db8" class="outline-2">
<h2 id="org5b67db8">Do Sorting</h2>
<div class="outline-text-2" id="text-org5b67db8">
<blockquote>
<p>
you should always try your best to get the result you want ,by <b>ONLY ONE TRAVERSE</b>.
</p>
</blockquote>

<p>
when refer to Ordering or Sorting or compute Max, one key thing should be kept in mind that, you are dealing with BIG DATA, try your best to traverse as least times as you can.
</p>

<p>
there are 3 useful methods for compute or ordering:
</p>
<ol class="org-ol">
<li>map &amp; filter (<b>VERY BAD</b>, consume too mem and time)</li>
<li>reduceLeft or foldLeft</li>
<li>maxBy, maxWith, sortBy, sortWith</li>
</ol>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Then you get the data ,and may ask some question, like:</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">what is highest temperature</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">BAD method</span>
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">maxTemp</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.map(<span style="color: #4f97d7; font-weight: bold;">_</span>.tmax).max
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">hotDays</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.filter(<span style="color: #4f97d7; font-weight: bold;">_</span>.tmax == maxTemp)
println(s<span style="color: #2d9574;">"Hot days are ${hotDays.mkString("</span>, <span style="color: #2d9574;">")}"</span>)

<span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">why bad?</span>
<span style="color: #2aa1ae; background-color: #292e34;"> BUUUT, drawbacks of code above is that, you do TRAVERSE directly</span>
<span style="color: #2aa1ae; background-color: #292e34;"> on WHOLE dataset THREE times, and create WHOLE NEW dataset TWO time:</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Traverse: data.map, data.map.max, data.filter. ===&gt; time consumer</span>
<span style="color: #2aa1ae; background-color: #292e34;"> New: data.map, data.filter                     ===&gt; memo consumer</span>
<span style="color: #2aa1ae; background-color: #292e34;"> If size of dataset is very large, this will get down the speed</span>
<span style="color: #2aa1ae; background-color: #292e34;"> and even lead to "Stack Over Flow"</span>
<span style="color: #2aa1ae; background-color: #292e34;">*/</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">GOOD method</span>
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">hotDay</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.maxBy(<span style="color: #4f97d7; font-weight: bold;">_</span>.tmax)
println(s<span style="color: #2d9574;">"Hot day is </span><span style="color: #7590db;">$hotDay</span><span style="color: #2d9574;">"</span>)

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">another GOOD</span>
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">hotDay2</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data.reduceLeft((d1,d2) <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">if</span> ( d1.tmax &gt;= d2.tmax ) d1 <span style="color: #4f97d7; font-weight: bold;">else</span> d2 )
println(s<span style="color: #2d9574;">"Hot day is </span><span style="color: #7590db;">$hotDay2</span><span style="color: #2d9574;">"</span>)
</pre>
</div>
</div>
</div>

<div id="org3a0062f" class="outline-2">
<h2 id="org3a0062f">Do Counting</h2>
<div class="outline-text-2" id="text-org3a0062f">
<p>
[Q]why using <code>x -&gt; y</code> instead of <code>(x,y)</code>
[A]you see that two <code>()</code> there :) , some time forgetting will lead a big error.
</p>

<blockquote>
<p>
you should always try your best to get the result you want ,by <b>ONLY ONE TRAVERSE</b>.
</p>
</blockquote>

<p>
So, <code>map</code> and <code>filter</code> is BAD, forget about them unless you have no choice.
</p>

<p>
<code>count</code> can hold, if do counting without other computation, else <code>foldLeft</code> and <code>flatMap</code> are two powerful tool to handle this
</p>

<ol class="org-ol">
<li>count</li>
<li>foldLeft</li>
<li>flatMap</li>
</ol>
</div>
</div>

<div id="org1af169f" class="outline-2">
<h2 id="org1af169f">Do something respectively on group</h2>
<div class="outline-text-2" id="text-org1af169f">
<ol class="org-ol">
<li>groupBy =&gt; map</li>
<li>grouped =&gt; Iterator</li>
</ol>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">arr</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Array</span>((<span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span>), (<span style="color: #a45bad;">4</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">4</span>), (<span style="color: #a45bad;">22</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">2342</span>),(<span style="color: #a45bad;">121</span>,<span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">234</span>),(<span style="color: #a45bad;">11</span>,<span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">111</span>))
arr.groupBy(<span style="color: #4f97d7; font-weight: bold;">_</span>._2)
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> scala.collection.immutable.Map[Int,Array[(Int, Int, Int)]] =</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Map(2 -&gt; Array((1,2,3), (4,2,4), (22,2,2342)),</span>
<span style="color: #2aa1ae; background-color: #292e34;"> 1 -&gt; Array((121,1,234), (11,1,111)))</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>

arr.grouped(<span style="color: #a45bad;">2</span>).toArray
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Array[Array[(Int, Int, Int)]] =</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Array(Array((1,2,3), (4,2,4)),</span>
<span style="color: #2aa1ae; background-color: #292e34;">       Array((22,2,2342), (121,1,234)),</span>
<span style="color: #2aa1ae; background-color: #292e34;">       Array((11,1,111)))</span>
<span style="color: #2aa1ae; background-color: #292e34;">*/</span>
</pre>
</div>

<p>
groupBy give us back a collection that makes it much easier to work on groupings of values which is often used very significant in the big data framework, eg. Hadoop was completely set up to work with key-value pairs, this key-value pair type of approach to things winds up being significant for a lot of our data analysis in SPARK
</p>
</div>
</div>

<div id="orgd377ad0" class="outline-2">
<h2 id="orgd377ad0">summarization</h2>
<div class="outline-text-2" id="text-orgd377ad0">
<pre class="example">
|-------------+-----------------------------+-------------------------------------|
| program     | process                     | key-tech                            |
|-------------+-----------------------------+-------------------------------------|
| pre-process | define case class           |                                     |
|             | .csv -&gt; source              | scala.io.Source.fromFile            |
|             | source -&gt; iterator          | getLines                            |
|             | iterator -&gt; Array[caseObje] | flatMap to filter out unrequirement |
|-------------+-----------------------------+-------------------------------------|
| computation | max                         | maxBy, reduceLeft                   |
|             | count                       | count                               |
|             | non-independent variable    | foldLeft, flatMap                   |
|             | group related variable      | groupBy -&gt; map((a,b)=&gt;a-&gt;{fnOnB}    |
|             |                             | -&gt; toSeq.sortBy                     |
|-------------+-----------------------------+-------------------------------------|
</pre>
</div>

<div id="org36ab8df" class="outline-3">
<h3 id="org36ab8df">1. pre-process</h3>
<div class="outline-text-3" id="text-org36ab8df">
<ul class="org-ul">
<li>define case class</li>
<li>.csv =&gt; scala.io.Source.fromFile =&gt; source</li>
<li>source =&gt; getLines =&gt; line iterator[String]</li>
<li>iterator =&gt; flatMap to ignore garbage data =&gt; array[caseObj]</li>
</ul>
</div>
</div>
<div id="orgc3794c3" class="outline-3">
<h3 id="orgc3794c3">2. computation</h3>
<div class="outline-text-3" id="text-orgc3794c3">
</div>
<div id="org9dd4630" class="outline-4">
<h4 id="org9dd4630">max:</h4>
<div class="outline-text-4" id="text-org9dd4630">
<ul class="org-ul">
<li><code>array.reduceLeft</code></li>
<li><code>array.maxBy</code></li>
</ul>
</div>
</div>
<div id="org8a4662b" class="outline-4">
<h4 id="org8a4662b">count:</h4>
<div class="outline-text-4" id="text-org8a4662b">
<p>
<code>array.count</code>
</p>
</div>
</div>
<div id="org90707ea" class="outline-4">
<h4 id="org90707ea">none-independent variable:</h4>
<div class="outline-text-4" id="text-org90707ea">
<p>
get embedded variable all at once by
</p>
<ul class="org-ul">
<li><code>array.foldLeft</code>, BAB</li>
<li><code>array.flatMap</code>, get a subset of requirement elements, get rid of others by its implicit fitering</li>
</ul>
</div>
</div>
<div id="org3351f48" class="outline-4">
<h4 id="org3351f48">group related variable</h4>
<div class="outline-text-4" id="text-org3351f48">
<ol class="org-ol">
<li><code>array.groupBy</code> , to get a map(group, <b>listOfCaseObject</b>)</li>
<li><code>Map.map{(a,b) =&gt; a -&gt; {fn on b}}</code>, to extract information you want and get another <code>Map</code></li>
<li><code>Map.toSeq.sortBy</code>, the thing sortBy must have some implicit coversion to Ordering[T]</li>
</ol>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
